insert into music_base.list_of_performes 
values
(1,'LegMC'),
(2,'Михаил Круг'),
(3,'Фредди Меркьюри'),
(4,'Руки вверх'),
(5,'Nirvana'),
(6,'DinoMC'),
(7,'Oxxxymiron'),
(8,'Eminem')
;

insert into music_base.album_list 
values 
(1, 'Скорость 2010', 2019),
(2, 'Жиган Лимон ', 1994),
(3, 'Mr.BadGuy', 1985),
(4, 'Без тормозов', 2018),
(5, 'Nevermind', 1991),
(6,'Среда обитания',2012),
(7,'Горгород', 2015),
(8, 'Recovery',2010)
;

insert into  music_base.track_list 
values
(1,1,'Пока мы будем здесь',2.2),
(2,1,'Попутчкики',3.5),
(3,2,'Электричка',3.1),
(4,2,'Девочка пай',4.3),
(5,3,'Made in Haven',4.1),
(6,3,'Mr.Bad guy',4.2),
(7,4,'Без любви',4.1),
(8,4,'Ну где же вы девчонки',4.5),
(9,5,'Breed',2.1),
(10,5,'Lithium',5.3),
(11,6,'Среда обитания',4.1),
(12,6,'Игры с огнем',4.3),
(13,7,'Накануне',3.3),
(14,7,'Полигон',3.1),
(15,8,'W.T.P',3.2),
(16,8,'On Fire',3.1)
;

insert into music_base.list_of_genres 
values
(1,'hip-hop'),
(2,'Шансон'),
(3,'Рок'),
(4,'Альтернатива'),
(5,'Поп')
;

insert into music_base.genres_performes
values
(1,1),
(1,6),
(1,7),
(1,8),
(2,2),
(3,3),
(4,5),
(5,4)
;

insert into music_base.album_performes 
values
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8)
;

insert into music_base.compilation 
values
(1,'Сборник - 1', 2017),
(2,'Сборник - 2', 2018),
(3,'Сборник - 3', 2019),
(4,'Сборник - 4', 2020),
(5,'Сборник - 5', 2021),
(6,'Сборник - 6', 2022),
(7,'Сборник - 7', 2016),
(8,'Сборник - 8', 2015)
;

insert into music_base.compilation_track 
values
(1,1),(3,1),(7,1),(12,1),
(3,2),(15,2),(11,2),(9,2),
(5,3),(6,3),(8,3),(1,3),
(9,4),(11,4),(3,4),(2,4),
(2,5),(13,5),(10,5),(11,5),
(13,6),(1,6),(3,6),(5,6),
(4,7),(1,7),(12,7),(11,7),
(13,8),(2,8),(1,8),(11,8)
;
